money_capital = 20000  # подушка безопасности
salary = 5000  # зарплата в месяц
spend = 6000  # траты за первый месяц
increase = 0.05  # ежемесячный рост цен
months = 0 # количество месяцев
while money_capital >= 0: # пока в подушке есть деньги
    if months > 0: # начиная со второго месяца
        spend = spend * 1.05  # увеличиваем расходы на 5%
    money_capital = money_capital - (spend - salary)  # из подушки вычитаем разницу между расходами и зарплатой
    months = months + 1 # счетчик месяцев
print("Количество месяцев, которое можно протянуть без долгов:", (months - 1)) # выводим на печать, последний месяц неполный
